SiliconLabs/simplicity_sdk/platform/Device/SiliconLabs/EFR32MG26/Include/efr32mg26_eusart.h
/* Bit fields for EUSART DALICFG */
#define _EUSART_DALICFG_RESETVALUE                    0x00000000UL                                      /**< Default value for EUSART_DALICFG            */
#define _EUSART_DALICFG_MASK                          0x00009F3FUL                                      /**< Mask for EUSART_DALICFG                     */
#define EUSART_DALICFG_DALIEN                         (0x1UL << 0)                                      /**< DALI Enable Bit                             */
#define _EUSART_DALICFG_DALIEN_SHIFT                  0                                                 /**< Shift value for EUSART_DALIEN               */
#define _EUSART_DALICFG_DALIEN_MASK                   0x1UL                                             /**< Bit mask for EUSART_DALIEN                  */
#define _EUSART_DALICFG_DALIEN_DEFAULT                0x00000000UL                                      /**< Mode DEFAULT for EUSART_DALICFG             */
#define EUSART_DALICFG_DALIEN_DEFAULT                 (_EUSART_DALICFG_DALIEN_DEFAULT << 0)             /**< Shifted mode DEFAULT for EUSART_DALICFG     */
#define _EUSART_DALICFG_DALITXDATABITS_SHIFT          1                                                 /**< Shift value for EUSART_DALITXDATABITS       */
#define _EUSART_DALICFG_DALITXDATABITS_MASK           0x3EUL                                            /**< Bit mask for EUSART_DALITXDATABITS          */
#define _EUSART_DALICFG_DALITXDATABITS_DEFAULT        0x00000000UL                                      /**< Mode DEFAULT for EUSART_DALICFG             */
#define _EUSART_DALICFG_DALITXDATABITS_EIGHT          0x00000000UL                                      /**< Mode EIGHT for EUSART_DALICFG               */
#define _EUSART_DALICFG_DALITXDATABITS_NINE           0x00000001UL                                      /**< Mode NINE for EUSART_DALICFG                */
#define _EUSART_DALICFG_DALITXDATABITS_TEN            0x00000002UL                                      /**< Mode TEN for EUSART_DALICFG                 */
#define _EUSART_DALICFG_DALITXDATABITS_ELEVEN         0x00000003UL                                      /**< Mode ELEVEN for EUSART_DALICFG              */
#define _EUSART_DALICFG_DALITXDATABITS_TWELVE         0x00000004UL                                      /**< Mode TWELVE for EUSART_DALICFG              */
#define _EUSART_DALICFG_DALITXDATABITS_THIRTEEN       0x00000005UL                                      /**< Mode THIRTEEN for EUSART_DALICFG            */
#define _EUSART_DALICFG_DALITXDATABITS_FOURTEEN       0x00000006UL                                      /**< Mode FOURTEEN for EUSART_DALICFG            */
#define _EUSART_DALICFG_DALITXDATABITS_FIFTEEN        0x00000007UL                                      /**< Mode FIFTEEN for EUSART_DALICFG             */
#define _EUSART_DALICFG_DALITXDATABITS_SIXTEEN        0x00000008UL                                      /**< Mode SIXTEEN for EUSART_DALICFG             */
#define _EUSART_DALICFG_DALITXDATABITS_SEVENTEEN      0x00000009UL                                      /**< Mode SEVENTEEN for EUSART_DALICFG           */
#define _EUSART_DALICFG_DALITXDATABITS_EIGHTEEN       0x0000000AUL                                      /**< Mode EIGHTEEN for EUSART_DALICFG            */
#define _EUSART_DALICFG_DALITXDATABITS_NINETEEN       0x0000000BUL                                      /**< Mode NINETEEN for EUSART_DALICFG            */
#define _EUSART_DALICFG_DALITXDATABITS_TWENTY         0x0000000CUL                                      /**< Mode TWENTY for EUSART_DALICFG              */
#define _EUSART_DALICFG_DALITXDATABITS_TWENTYONE      0x0000000DUL                                      /**< Mode TWENTYONE for EUSART_DALICFG           */
#define _EUSART_DALICFG_DALITXDATABITS_TWENTYTWO      0x0000000EUL                                      /**< Mode TWENTYTWO for EUSART_DALICFG           */
#define _EUSART_DALICFG_DALITXDATABITS_TWENTYTHREE    0x0000000FUL                                      /**< Mode TWENTYTHREE for EUSART_DALICFG         */
#define _EUSART_DALICFG_DALITXDATABITS_TWENTYFOUR     0x00000010UL                                      /**< Mode TWENTYFOUR for EUSART_DALICFG          */
#define _EUSART_DALICFG_DALITXDATABITS_TWENTYFIVE     0x00000011UL                                      /**< Mode TWENTYFIVE for EUSART_DALICFG          */
#define _EUSART_DALICFG_DALITXDATABITS_TWENTYSIX      0x00000012UL                                      /**< Mode TWENTYSIX for EUSART_DALICFG           */
#define _EUSART_DALICFG_DALITXDATABITS_TWENTYSEVEN    0x00000013UL                                      /**< Mode TWENTYSEVEN for EUSART_DALICFG         */
#define _EUSART_DALICFG_DALITXDATABITS_TWENTYEIGHT    0x00000014UL                                      /**< Mode TWENTYEIGHT for EUSART_DALICFG         */
#define _EUSART_DALICFG_DALITXDATABITS_TWENTYNINE     0x00000015UL                                      /**< Mode TWENTYNINE for EUSART_DALICFG          */
#define _EUSART_DALICFG_DALITXDATABITS_THIRTY         0x00000016UL                                      /**< Mode THIRTY for EUSART_DALICFG              */
#define _EUSART_DALICFG_DALITXDATABITS_THIRTYONE      0x00000017UL                                      /**< Mode THIRTYONE for EUSART_DALICFG           */
#define _EUSART_DALICFG_DALITXDATABITS_THIRTYTWO      0x00000018UL                                      /**< Mode THIRTYTWO for EUSART_DALICFG           */
#define EUSART_DALICFG_DALITXDATABITS_DEFAULT         (_EUSART_DALICFG_DALITXDATABITS_DEFAULT << 1)     /**< Shifted mode DEFAULT for EUSART_DALICFG     */
#define EUSART_DALICFG_DALITXDATABITS_EIGHT           (_EUSART_DALICFG_DALITXDATABITS_EIGHT << 1)       /**< Shifted mode EIGHT for EUSART_DALICFG       */
#define EUSART_DALICFG_DALITXDATABITS_NINE            (_EUSART_DALICFG_DALITXDATABITS_NINE << 1)        /**< Shifted mode NINE for EUSART_DALICFG        */
#define EUSART_DALICFG_DALITXDATABITS_TEN             (_EUSART_DALICFG_DALITXDATABITS_TEN << 1)         /**< Shifted mode TEN for EUSART_DALICFG         */
#define EUSART_DALICFG_DALITXDATABITS_ELEVEN          (_EUSART_DALICFG_DALITXDATABITS_ELEVEN << 1)      /**< Shifted mode ELEVEN for EUSART_DALICFG      */
#define EUSART_DALICFG_DALITXDATABITS_TWELVE          (_EUSART_DALICFG_DALITXDATABITS_TWELVE << 1)      /**< Shifted mode TWELVE for EUSART_DALICFG      */
#define EUSART_DALICFG_DALITXDATABITS_THIRTEEN        (_EUSART_DALICFG_DALITXDATABITS_THIRTEEN << 1)    /**< Shifted mode THIRTEEN for EUSART_DALICFG    */
#define EUSART_DALICFG_DALITXDATABITS_FOURTEEN        (_EUSART_DALICFG_DALITXDATABITS_FOURTEEN << 1)    /**< Shifted mode FOURTEEN for EUSART_DALICFG    */
#define EUSART_DALICFG_DALITXDATABITS_FIFTEEN         (_EUSART_DALICFG_DALITXDATABITS_FIFTEEN << 1)     /**< Shifted mode FIFTEEN for EUSART_DALICFG     */
#define EUSART_DALICFG_DALITXDATABITS_SIXTEEN         (_EUSART_DALICFG_DALITXDATABITS_SIXTEEN << 1)     /**< Shifted mode SIXTEEN for EUSART_DALICFG     */
#define EUSART_DALICFG_DALITXDATABITS_SEVENTEEN       (_EUSART_DALICFG_DALITXDATABITS_SEVENTEEN << 1)   /**< Shifted mode SEVENTEEN for EUSART_DALICFG   */
#define EUSART_DALICFG_DALITXDATABITS_EIGHTEEN        (_EUSART_DALICFG_DALITXDATABITS_EIGHTEEN << 1)    /**< Shifted mode EIGHTEEN for EUSART_DALICFG    */
#define EUSART_DALICFG_DALITXDATABITS_NINETEEN        (_EUSART_DALICFG_DALITXDATABITS_NINETEEN << 1)    /**< Shifted mode NINETEEN for EUSART_DALICFG    */
#define EUSART_DALICFG_DALITXDATABITS_TWENTY          (_EUSART_DALICFG_DALITXDATABITS_TWENTY << 1)      /**< Shifted mode TWENTY for EUSART_DALICFG      */
#define EUSART_DALICFG_DALITXDATABITS_TWENTYONE       (_EUSART_DALICFG_DALITXDATABITS_TWENTYONE << 1)   /**< Shifted mode TWENTYONE for EUSART_DALICFG   */
#define EUSART_DALICFG_DALITXDATABITS_TWENTYTWO       (_EUSART_DALICFG_DALITXDATABITS_TWENTYTWO << 1)   /**< Shifted mode TWENTYTWO for EUSART_DALICFG   */
#define EUSART_DALICFG_DALITXDATABITS_TWENTYTHREE     (_EUSART_DALICFG_DALITXDATABITS_TWENTYTHREE << 1) /**< Shifted mode TWENTYTHREE for EUSART_DALICFG */
#define EUSART_DALICFG_DALITXDATABITS_TWENTYFOUR      (_EUSART_DALICFG_DALITXDATABITS_TWENTYFOUR << 1)  /**< Shifted mode TWENTYFOUR for EUSART_DALICFG  */
#define EUSART_DALICFG_DALITXDATABITS_TWENTYFIVE      (_EUSART_DALICFG_DALITXDATABITS_TWENTYFIVE << 1)  /**< Shifted mode TWENTYFIVE for EUSART_DALICFG  */
#define EUSART_DALICFG_DALITXDATABITS_TWENTYSIX       (_EUSART_DALICFG_DALITXDATABITS_TWENTYSIX << 1)   /**< Shifted mode TWENTYSIX for EUSART_DALICFG   */
#define EUSART_DALICFG_DALITXDATABITS_TWENTYSEVEN     (_EUSART_DALICFG_DALITXDATABITS_TWENTYSEVEN << 1) /**< Shifted mode TWENTYSEVEN for EUSART_DALICFG */
#define EUSART_DALICFG_DALITXDATABITS_TWENTYEIGHT     (_EUSART_DALICFG_DALITXDATABITS_TWENTYEIGHT << 1) /**< Shifted mode TWENTYEIGHT for EUSART_DALICFG */
#define EUSART_DALICFG_DALITXDATABITS_TWENTYNINE      (_EUSART_DALICFG_DALITXDATABITS_TWENTYNINE << 1)  /**< Shifted mode TWENTYNINE for EUSART_DALICFG  */
#define EUSART_DALICFG_DALITXDATABITS_THIRTY          (_EUSART_DALICFG_DALITXDATABITS_THIRTY << 1)      /**< Shifted mode THIRTY for EUSART_DALICFG      */
#define EUSART_DALICFG_DALITXDATABITS_THIRTYONE       (_EUSART_DALICFG_DALITXDATABITS_THIRTYONE << 1)   /**< Shifted mode THIRTYONE for EUSART_DALICFG   */
#define EUSART_DALICFG_DALITXDATABITS_THIRTYTWO       (_EUSART_DALICFG_DALITXDATABITS_THIRTYTWO << 1)   /**< Shifted mode THIRTYTWO for EUSART_DALICFG   */
#define _EUSART_DALICFG_DALIRXDATABITS_SHIFT          8                                                 /**< Shift value for EUSART_DALIRXDATABITS       */
#define _EUSART_DALICFG_DALIRXDATABITS_MASK           0x1F00UL                                          /**< Bit mask for EUSART_DALIRXDATABITS          */
#define _EUSART_DALICFG_DALIRXDATABITS_DEFAULT        0x00000000UL                                      /**< Mode DEFAULT for EUSART_DALICFG             */
#define _EUSART_DALICFG_DALIRXDATABITS_EIGHT          0x00000000UL                                      /**< Mode EIGHT for EUSART_DALICFG               */
#define _EUSART_DALICFG_DALIRXDATABITS_NINE           0x00000001UL                                      /**< Mode NINE for EUSART_DALICFG                */
#define _EUSART_DALICFG_DALIRXDATABITS_TEN            0x00000002UL                                      /**< Mode TEN for EUSART_DALICFG                 */
#define _EUSART_DALICFG_DALIRXDATABITS_ELEVEN         0x00000003UL                                      /**< Mode ELEVEN for EUSART_DALICFG              */
#define _EUSART_DALICFG_DALIRXDATABITS_TWELVE         0x00000004UL                                      /**< Mode TWELVE for EUSART_DALICFG              */
#define _EUSART_DALICFG_DALIRXDATABITS_THIRTEEN       0x00000005UL                                      /**< Mode THIRTEEN for EUSART_DALICFG            */
#define _EUSART_DALICFG_DALIRXDATABITS_FOURTEEN       0x00000006UL                                      /**< Mode FOURTEEN for EUSART_DALICFG            */
#define _EUSART_DALICFG_DALIRXDATABITS_FIFTEEN        0x00000007UL                                      /**< Mode FIFTEEN for EUSART_DALICFG             */
#define _EUSART_DALICFG_DALIRXDATABITS_SIXTEEN        0x00000008UL                                      /**< Mode SIXTEEN for EUSART_DALICFG             */
#define _EUSART_DALICFG_DALIRXDATABITS_SEVENTEEN      0x00000009UL                                      /**< Mode SEVENTEEN for EUSART_DALICFG           */
#define _EUSART_DALICFG_DALIRXDATABITS_EIGHTEEN       0x0000000AUL                                      /**< Mode EIGHTEEN for EUSART_DALICFG            */
#define _EUSART_DALICFG_DALIRXDATABITS_NINETEEN       0x0000000BUL                                      /**< Mode NINETEEN for EUSART_DALICFG            */
#define _EUSART_DALICFG_DALIRXDATABITS_TWENTY         0x0000000CUL                                      /**< Mode TWENTY for EUSART_DALICFG              */
#define _EUSART_DALICFG_DALIRXDATABITS_TWENTYONE      0x0000000DUL                                      /**< Mode TWENTYONE for EUSART_DALICFG           */
#define _EUSART_DALICFG_DALIRXDATABITS_TWENTYTWO      0x0000000EUL                                      /**< Mode TWENTYTWO for EUSART_DALICFG           */
#define _EUSART_DALICFG_DALIRXDATABITS_TWENTYTHREE    0x0000000FUL                                      /**< Mode TWENTYTHREE for EUSART_DALICFG         */
#define _EUSART_DALICFG_DALIRXDATABITS_TWENTYFOUR     0x00000010UL                                      /**< Mode TWENTYFOUR for EUSART_DALICFG          */
#define _EUSART_DALICFG_DALIRXDATABITS_TWENTYFIVE     0x00000011UL                                      /**< Mode TWENTYFIVE for EUSART_DALICFG          */
#define _EUSART_DALICFG_DALIRXDATABITS_TWENTYSIX      0x00000012UL                                      /**< Mode TWENTYSIX for EUSART_DALICFG           */
#define _EUSART_DALICFG_DALIRXDATABITS_TWENTYSEVEN    0x00000013UL                                      /**< Mode TWENTYSEVEN for EUSART_DALICFG         */
#define _EUSART_DALICFG_DALIRXDATABITS_TWENTYEIGHT    0x00000014UL                                      /**< Mode TWENTYEIGHT for EUSART_DALICFG         */
#define _EUSART_DALICFG_DALIRXDATABITS_TWENTYNINE     0x00000015UL                                      /**< Mode TWENTYNINE for EUSART_DALICFG          */
#define _EUSART_DALICFG_DALIRXDATABITS_THIRTY         0x00000016UL                                      /**< Mode THIRTY for EUSART_DALICFG              */
#define _EUSART_DALICFG_DALIRXDATABITS_THIRTYONE      0x00000017UL                                      /**< Mode THIRTYONE for EUSART_DALICFG           */
#define _EUSART_DALICFG_DALIRXDATABITS_THIRTYTWO      0x00000018UL                                      /**< Mode THIRTYTWO for EUSART_DALICFG           */
#define EUSART_DALICFG_DALIRXDATABITS_DEFAULT         (_EUSART_DALICFG_DALIRXDATABITS_DEFAULT << 8)     /**< Shifted mode DEFAULT for EUSART_DALICFG     */
#define EUSART_DALICFG_DALIRXDATABITS_EIGHT           (_EUSART_DALICFG_DALIRXDATABITS_EIGHT << 8)       /**< Shifted mode EIGHT for EUSART_DALICFG       */
#define EUSART_DALICFG_DALIRXDATABITS_NINE            (_EUSART_DALICFG_DALIRXDATABITS_NINE << 8)        /**< Shifted mode NINE for EUSART_DALICFG        */
#define EUSART_DALICFG_DALIRXDATABITS_TEN             (_EUSART_DALICFG_DALIRXDATABITS_TEN << 8)         /**< Shifted mode TEN for EUSART_DALICFG         */
#define EUSART_DALICFG_DALIRXDATABITS_ELEVEN          (_EUSART_DALICFG_DALIRXDATABITS_ELEVEN << 8)      /**< Shifted mode ELEVEN for EUSART_DALICFG      */
#define EUSART_DALICFG_DALIRXDATABITS_TWELVE          (_EUSART_DALICFG_DALIRXDATABITS_TWELVE << 8)      /**< Shifted mode TWELVE for EUSART_DALICFG      */
#define EUSART_DALICFG_DALIRXDATABITS_THIRTEEN        (_EUSART_DALICFG_DALIRXDATABITS_THIRTEEN << 8)    /**< Shifted mode THIRTEEN for EUSART_DALICFG    */
#define EUSART_DALICFG_DALIRXDATABITS_FOURTEEN        (_EUSART_DALICFG_DALIRXDATABITS_FOURTEEN << 8)    /**< Shifted mode FOURTEEN for EUSART_DALICFG    */
#define EUSART_DALICFG_DALIRXDATABITS_FIFTEEN         (_EUSART_DALICFG_DALIRXDATABITS_FIFTEEN << 8)     /**< Shifted mode FIFTEEN for EUSART_DALICFG     */
#define EUSART_DALICFG_DALIRXDATABITS_SIXTEEN         (_EUSART_DALICFG_DALIRXDATABITS_SIXTEEN << 8)     /**< Shifted mode SIXTEEN for EUSART_DALICFG     */
#define EUSART_DALICFG_DALIRXDATABITS_SEVENTEEN       (_EUSART_DALICFG_DALIRXDATABITS_SEVENTEEN << 8)   /**< Shifted mode SEVENTEEN for EUSART_DALICFG   */
#define EUSART_DALICFG_DALIRXDATABITS_EIGHTEEN        (_EUSART_DALICFG_DALIRXDATABITS_EIGHTEEN << 8)    /**< Shifted mode EIGHTEEN for EUSART_DALICFG    */
#define EUSART_DALICFG_DALIRXDATABITS_NINETEEN        (_EUSART_DALICFG_DALIRXDATABITS_NINETEEN << 8)    /**< Shifted mode NINETEEN for EUSART_DALICFG    */
#define EUSART_DALICFG_DALIRXDATABITS_TWENTY          (_EUSART_DALICFG_DALIRXDATABITS_TWENTY << 8)      /**< Shifted mode TWENTY for EUSART_DALICFG      */
#define EUSART_DALICFG_DALIRXDATABITS_TWENTYONE       (_EUSART_DALICFG_DALIRXDATABITS_TWENTYONE << 8)   /**< Shifted mode TWENTYONE for EUSART_DALICFG   */
#define EUSART_DALICFG_DALIRXDATABITS_TWENTYTWO       (_EUSART_DALICFG_DALIRXDATABITS_TWENTYTWO << 8)   /**< Shifted mode TWENTYTWO for EUSART_DALICFG   */
#define EUSART_DALICFG_DALIRXDATABITS_TWENTYTHREE     (_EUSART_DALICFG_DALIRXDATABITS_TWENTYTHREE << 8) /**< Shifted mode TWENTYTHREE for EUSART_DALICFG */
#define EUSART_DALICFG_DALIRXDATABITS_TWENTYFOUR      (_EUSART_DALICFG_DALIRXDATABITS_TWENTYFOUR << 8)  /**< Shifted mode TWENTYFOUR for EUSART_DALICFG  */
#define EUSART_DALICFG_DALIRXDATABITS_TWENTYFIVE      (_EUSART_DALICFG_DALIRXDATABITS_TWENTYFIVE << 8)  /**< Shifted mode TWENTYFIVE for EUSART_DALICFG  */
#define EUSART_DALICFG_DALIRXDATABITS_TWENTYSIX       (_EUSART_DALICFG_DALIRXDATABITS_TWENTYSIX << 8)   /**< Shifted mode TWENTYSIX for EUSART_DALICFG   */
#define EUSART_DALICFG_DALIRXDATABITS_TWENTYSEVEN     (_EUSART_DALICFG_DALIRXDATABITS_TWENTYSEVEN << 8) /**< Shifted mode TWENTYSEVEN for EUSART_DALICFG */
#define EUSART_DALICFG_DALIRXDATABITS_TWENTYEIGHT     (_EUSART_DALICFG_DALIRXDATABITS_TWENTYEIGHT << 8) /**< Shifted mode TWENTYEIGHT for EUSART_DALICFG */
#define EUSART_DALICFG_DALIRXDATABITS_TWENTYNINE      (_EUSART_DALICFG_DALIRXDATABITS_TWENTYNINE << 8)  /**< Shifted mode TWENTYNINE for EUSART_DALICFG  */
#define EUSART_DALICFG_DALIRXDATABITS_THIRTY          (_EUSART_DALICFG_DALIRXDATABITS_THIRTY << 8)      /**< Shifted mode THIRTY for EUSART_DALICFG      */
#define EUSART_DALICFG_DALIRXDATABITS_THIRTYONE       (_EUSART_DALICFG_DALIRXDATABITS_THIRTYONE << 8)   /**< Shifted mode THIRTYONE for EUSART_DALICFG   */
#define EUSART_DALICFG_DALIRXDATABITS_THIRTYTWO       (_EUSART_DALICFG_DALIRXDATABITS_THIRTYTWO << 8)   /**< Shifted mode THIRTYTWO for EUSART_DALICFG   */
#define EUSART_DALICFG_DALIRXENDT                     (0x1UL << 15)                                     /**< DALI RX Enabled During Transmission         */
#define _EUSART_DALICFG_DALIRXENDT_SHIFT              15                                                /**< Shift value for EUSART_DALIRXENDT           */
#define _EUSART_DALICFG_DALIRXENDT_MASK               0x8000UL                                          /**< Bit mask for EUSART_DALIRXENDT              */
#define _EUSART_DALICFG_DALIRXENDT_DEFAULT            0x00000000UL                                      /**< Mode DEFAULT for EUSART_DALICFG             */
#define EUSART_DALICFG_DALIRXENDT_DEFAULT             (_EUSART_DALICFG_DALIRXENDT_DEFAULT << 15)        /**< Shifted mode DEFAULT for EUSART_DALICFG     */

/** @} End of group EFR32MG26_EUSART_BitFields */
/** @} End of group EFR32MG26_EUSART */
/** @} End of group Parts */

#endif // EFR32MG26_EUSART_H
